In [1]:
import pandas as pd 
import numpy as np 
data=pd.read_csv('data.csv')
print(data)

      name  age gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M    NaN
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_6432\1540598260.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.DataFrame(data)
df

      name  age gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M    NaN
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [3]:
avg = df.mean(numeric_only=True)
avg

age      17.285714
Marks    75.200000
dtype: float64

In [6]:
df['Marks'] = df['Marks'].fillna(avg['Marks'])
df

      name  age gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M   75.2
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F   75.2
6     Riya   17      F   71.0

In [ ]:
df['gender'] = df['gender'].map({'M':0, 'F':1}).astype(float)
df